Revit 2027 API
CableType.GetUsableCableSizeIds Method
 Gets all the Cable Sizes that can be used by this Cable Type, sorted by name.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetUsableCableSizeIds()
Public Function GetUsableCableSizeIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetUsableCableSizeIds()
member GetUsableCableSizeIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 All the Cable Size ids that can be used by this Cable Type.
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace